# num1 = 10
# num2 = 0
# assert num2 != 0, 'The divisor is zero'
# print(f'The result {num1 / num2}')
#
#
# def avf(ranks):
#     assert len(ranks) != 0, f'smth wrong'
#     assert type(ranks) == list, 'smth wrong'
#     return sum(ranks) / len(ranks)
#
#
# ranks = tuple((i for i in range(6)))
# print(f'Среднее арифметическое {avf(ranks)}')


# Создать функцию, которая будет считать сумму элементов значений словаря, значения должны быть целые числа



