#  7. Создать список с числами от 1 до 50 используя генератор списков.

numbers = [digit for digit in range(1, 51)]
print(numbers)