#  1. Какой тип данных используется для хранения целых чисел в Python?
"""a. int"""

#  2. Какой тип данных используется для хранения вещественных чисел в Python?
"""b. float"""

#  3. Какой тип данных используется для хранения строк в Python?
"""c. str"""

#  4. Какая операция используется для объединения двух строк в Python?
"""a. +"""

#  5. Какой оператор используется для проверки равенства значений в Python?
"""b. =="""

#  6. Какой оператор используется для проверки больше или меньше значения в Python?
"""d. <>"""

#  7. Какой оператор используется для проверки, входит ли элемент в список в Python?
"""a. in"""

#  8. Какой оператор используется для проверки, является ли элемент частью строки в Python?
"""a. in"""

#  9. Какой оператор используется для создания условия if в Python?
"""a. if"""

#  10. Какой оператор используется для выхода из цикла в Python?
"""a. break"""

#  11. Какой оператор используется для продолжения выполнения цикла в Python?
"""b. continue"""

#  12. Какой оператор используется для получения элемента списка по индексу в Python?
"b. index()"

#  13. Какой оператор используется для добавления элемента в конец списка в Python?
"""c. append()"""

#  14. Какой оператор используется для удаления элемента из списка в Python?
"""b. remove()"""
"""c. pop()"""

#  15. Какой оператор используется для получения длины списка в Python?
"""d. len()"""

#  16. Что будет результатом программы и почему?
"""x = 4.5"""
"""y = 2"""
"""print(x // y)"""
"""Результатом программы будет 2.0. Так как "//" - это целочисленное деление и всегда будет отбрасываться остаток.
А ответ - вещественное число, так как первый аргумент является вещественным числом."""

#  17. Какая будет итоговая длина списка и почему?
"""a = [1 ,2 ,3, None, (), [] , ]"""
"""print(len(a))"""
"""Результатом будет "6", так как пробелы не учитываются, потому что они не являются элементами списка,
если конечно не находятся в кавычках " ", в таком случае будут учитываться."""

#  18. Какой будет результат программы?
# x = True
# y = False
# z = False
# if not x or y:  # false or false
#     print(1)
# elif not x or not y and z:  # false or true and false
#     print(2)
# elif not x or y or not y and x: # false or false or true and true
#     print(3)
# else:
#     print(4)
"""Результатом программы будет "3"."""

#  19. Что выведет следующий код, при его исполнении?
# print(type(1 / 2))
"""Так как данное деление является не целочисленным, то выведет "float"."""

#  20. Какие из приведенных ниже имен переменных не корректны?
"""a. my-var"""
