# Вывести на экран числа от 0 до 50, кроме 35.



for i in range(0,50):
    if i == 35:
        continue
    print(i)