# 	Дан список [student1, student2, student3] с помощью цикла for добавить к каждому элементу списка слово “_good”. Вывести на экран.
list1 = ['student1', 'student2', 'student3']

for i in list1:
    print(i + '_good')
