# Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.

num1 = ''
if num1:
    print('Не пустая')
else:
    print('Пустая')
