"""1. Даны 2 действительных числа a и b. Получить их сумму, разность и произведение."""

a = 3
b = 4
res_1 = a + b
res_2 = a - b
res_3 = a * b
print('Сложение:', res_1)
print('Вычитание:', res_2)
print('Умножение:', res_3)