"""2. Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел."""
import math
a = 5
b = 8
res_1 = (a + b) / 2
res_2 = math.sqrt(a * b)
print('Среднее арифметическое:', res_1)
print('Среднее геометрическое:', res_2)