"""
Шахматный король ходит по горизонтали, вертикали и диагонали,
но только на 1 клетку. Даны две различные клетки шахматной доски,
определите, может ли король попасть с первой клетки на вторую одним ходом.
Пример
Cell 1 coordinates:
4, 4
Cell 2 coordinated:
5, 5
YES
Конь
Определите, может ли конь попасть с первой клетки на вторую одним ходом.
Ладья
Определите, может ли ладья попасть с первой клетки на вторую одним ходом.
Ферзь
Определите, может ли ферзь попасть с первой клетки на вторую одним ходом.
Слон
определите, может ли слон попасть с первой клетки на вторую одним ходом.
"""

